In [27]:
print('hello, world!')

hello, world!

In [28]:
import os
from data import SQLData
from datasets import Dataset
from dotenv import load_dotenv
import datasets

load_dotenv("../../.env")

True

In [29]:
HUGGING_FACE_WRITE_TOKEN = os.getenv("HUGGING_FACE_WRITE_TOKEN")

hf_spider_dev = 'alagaesia/spider_dev'
hf_spider_dev_preds = 'alagaesia/spider_dev_preds'

In [30]:
sqp = SQLData.from_dataset(hf_spider_dev)

Downloading readme:   0%|          | 0.00/1.46k [00:00<?, ?B/s]

Downloading data files:   0%|          | 0/1 [00:00<?, ?it/s]

Downloading data:   0%|          | 0.00/82.2k [00:00<?, ?B/s]

Extracting data files:   0%|          | 0/1 [00:00<?, ?it/s]

Generating train split:   0%|          | 0/1034 [00:00<?, ? examples/s]

In [31]:
#sqp.load_data(hf_spider_dev_preds)

In [32]:
sqp.data[hf_spider_dev]['train'][0]

{'db_id': 'concert_singer',
 'query': 'SELECT count(*) FROM singer',
 'question': 'How many singers do we have?',
 'create_w_keys': 'CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") ); ',
 'create_wo_keys': 'CREATE TABLE stadium (Stadium_ID INT, Location TEXT, Name TEXT, Capacity INT, Highest INT, Lowest INT, Average INT); CREATE TABLE singer (Singer_ID INT, Name TEXT, Country TEXT, Song_Name TEXT, Song_release_year TEXT, Age INT, Is_male bool); CREATE TABLE concert (concert_ID INT, concert_Name TEXT, Theme TEXT, Stadium_ID TEXT, Year TEXT); CREATE TABLE singer_in_concert (concert_ID INT, Singer_ID TEXT); ',
 'difficulty': 'easy'}

In [33]:

def dep_request_creation(
    strings: list[str],
    create_statement: str,
    question: str,
    create_statement_index: int,
    question_index: int,
) -> str: 
    
    modified_strings = strings.copy()
    
    modified_strings.insert(create_statement_index, create_statement)
    modified_strings.insert(question_index, question)

    return ' '.join(modified_strings)

def dep_dataset_request_creation(
    dataset: Dataset,
    strings: list[str],
    request_column: str,
    create_statement_column: str,
    question_column: str,
    create_statement_index: int,
    question_index: int,
) -> str: 
    
    create_statement = dataset[create_statement_column]
    question = dataset[question_column]

    request_string = dep_request_creation(
        strings,
        create_statement,
        question,
        create_statement_index,
        question_index,
    )

    return {request_column: request_string}

request_column = 'zero_shot_request_complex'
create_statement_column = 'create_w_keys'
question_column = 'question'

strings = ['Given the following SQL schema: ', 'Provide a SQL query that answers the following question: ', 'Only respond with the SQL query.']

strings = [
    '### Complete sqlite SQL query only and with no explanation, and do not select extra columns that are not explicitly requested in the query.\n',
    '### Sqlite SQL tables, with their properties:\n',
    '#\n',
    '# ', # create statement goes here (index 4)
    '\n', 
    '#\n',
    '### ', # question goes here (index 8) - must account for prior insertion
    '\n', 
    'SQL QUERY:',
]

create_statement_index = 4
question_index = 8

sqp.data[hf_spider_dev]['train'] = sqp.data[hf_spider_dev]['train'].map(dep_dataset_request_creation, fn_kwargs = {'strings': strings, 'request_column': request_column, 'create_statement_column': create_statement_column, 'question_column': question_column, 'create_statement_index': create_statement_index, 'question_index': question_index}, load_from_cache_file=False)

Map:   0%|          | 0/1034 [00:00<?, ? examples/s]

In [35]:
sqp.data[hf_spider_dev]['train'][0]['zero_shot_request_complex']

'### Complete sqlite SQL query only and with no explanation, and do not select extra columns that are not explicitly requested in the query.\n ### Sqlite SQL tables, with their properties:\n #\n #  CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") );  \n #\n ###  How many singers do we have? \n SQL QUERY:'

In [36]:
sqp.data[hf_spider_dev]['train']

Dataset({
    features: ['db_id', 'query', 'question', 'create_w_keys', 'create_wo_keys', 'difficulty', 'zero_shot_request_complex'],
    num_rows: 1034
})

In [37]:
def request_creation(
    create_statement: str, 
    question: str,
):
    return f"Provide the SQL query that answers the QUESTION, with no explanation or special characters. CONTEXT: Relevant SQL tables, with their properties: {create_statement} QUESTION: {question} "

def dataset_request_creation(
    dataset: Dataset,
    request_column: str,
    create_statement_column: str,
    question_column: str,
):
    
    create_statement = dataset[create_statement_column]
    question = dataset[question_column]

    request_string = request_creation(
        create_statement,
        question,
    )

    return {request_column: request_string}

In [38]:
request_column = 'zero_shot_request'
create_statement_column = 'create_w_keys'
question_column = 'question'

In [39]:
sqp.data[hf_spider_dev]['train'] = sqp.data[hf_spider_dev]['train'].map(dataset_request_creation, fn_kwargs = {'request_column': request_column, 'create_statement_column': create_statement_column, 'question_column': question_column}, load_from_cache_file=False)

Map:   0%|          | 0/1034 [00:00<?, ? examples/s]

In [40]:
sqp.data[hf_spider_dev]['train'][0]

{'db_id': 'concert_singer',
 'query': 'SELECT count(*) FROM singer',
 'question': 'How many singers do we have?',
 'create_w_keys': 'CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") ); ',
 'create_wo_keys': 'CREATE TABLE stadium (Stadium_ID INT, Location TEXT, Name TEXT, Capacity INT, Highest INT, Lowest INT, Average INT); CREATE TABLE singer (Singer_ID INT, Name TEXT, Country TEXT, Song_Name TEXT, Song_release_year TEXT, Age INT, Is_male bool); CREATE TABLE concert (concert_ID INT, concert_Name TEXT, Theme TEXT, Stadium_ID TEXT, Year TEXT); CREATE TABLE singer_in_concert (concert_ID INT, Singer_ID TEXT); ',
 'difficulty': 'easy',
 'zero_shot_request_complex': '### Complete sqlite SQL query only and with no explanation, and do not select extra columns that are not explicitly requested in the query.\n ### Sqlite SQL tables, with their properties:\n #\n #  CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") );  \n #\n ###  How many singers do we have? \n SQL QUERY:',
 'zero_shot_request': 'Provide the SQL query that answers the QUESTION, with no explanation or special characters. CONTEXT: Relevant SQL tables, with their properties: CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") );  QUESTION: How many singers do we have? '}

In [12]:
print(sqp.data[hf_spider_dev]['train'][0]['zero_shot_request'])

Provide the SQL query that answers the QUESTION, with no explanation or special characters. CONTEXT: Relevant SQL tables, with their properties: CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") );  QUESTION: How many singers do we have?

In [ ]:
'''
sqp.hub_upload(
    repo_id=hf_spider_dev_preds,
    token=HUGGING_FACE_WRITE_TOKEN,
    dataset=sqp.data[hf_spider_dev],
)
'''

In [13]:
sqp.data[hf_spider_dev]['train'][0]

{'db_id': 'concert_singer',
 'query': 'SELECT count(*) FROM singer',
 'question': 'How many singers do we have?',
 'create_w_keys': 'CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") ); ',
 'create_wo_keys': 'CREATE TABLE stadium (Stadium_ID INT, Location TEXT, Name TEXT, Capacity INT, Highest INT, Lowest INT, Average INT); CREATE TABLE singer (Singer_ID INT, Name TEXT, Country TEXT, Song_Name TEXT, Song_release_year TEXT, Age INT, Is_male bool); CREATE TABLE concert (concert_ID INT, concert_Name TEXT, Theme TEXT, Stadium_ID TEXT, Year TEXT); CREATE TABLE singer_in_concert (concert_ID INT, Singer_ID TEXT); ',
 'difficulty': 'easy',
 'zero_shot_request': 'Provide the SQL query that answers the QUESTION, with no explanation or special characters. CONTEXT: Relevant SQL tables, with their properties: CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") );  QUESTION: How many singers do we have? '}

In [14]:
goal = 200
goal_per_each = 3
db_ids = {}
subset = []

db_queries = {}

sqp.data[hf_spider_dev]['train'][0]

for i in range(len(sqp.data[hf_spider_dev]['train'])):

    db_id = sqp.data[hf_spider_dev]['train'][i]['db_id']
    difficulty = sqp.data[hf_spider_dev]['train'][i]['difficulty']
    query = sqp.data[hf_spider_dev]['train'][i]['query']

    if db_id not in db_ids:
        db_ids[db_id] = {}
        db_ids[db_id][difficulty] = 1

        db_queries[db_id] = {}
        db_queries[db_id][difficulty] = [query]

        subset.append(sqp.data[hf_spider_dev]['train'][i])
    else:
        if difficulty not in db_ids[db_id]:
            db_ids[db_id][difficulty] = 1

            db_queries[db_id][difficulty] = [query]

            subset.append(sqp.data[hf_spider_dev]['train'][i])
        else:
            if db_ids[db_id][difficulty] < goal_per_each and query not in db_queries[db_id][difficulty]:
                db_ids[db_id][difficulty] += 1

                db_queries[db_id][difficulty].append(query)

                subset.append(sqp.data[hf_spider_dev]['train'][i])
            else: 
                continue

In [16]:
curated_dataset = Dataset.from_dict({k: [item[k] for item in subset] for k in subset[0]})

In [17]:
curated_dataset['query']

['SELECT count(*) FROM singer',
 'SELECT name ,  country ,  age FROM singer ORDER BY age DESC',
 "SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'",
 'SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1',
 'SELECT DISTINCT country FROM singer WHERE age  >  20',
 'SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)',
 'SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1',
 'select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1',
 'SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1',
 'SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)',
 'SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015',
 'SELECT count(*) FROM pets WHERE weight  >  10',
 'SELECT weight FROM pets ORDER BY pet_age LIMIT 1',
 'SELECT max(weight) ,  petType FROM pets GROUP BY petType',
 'SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20',
 "SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'",
 'SELECT count(DISTINCT pettype) FROM pets',
 "SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'",
 "select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'",
 "SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'",
 "SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'",
 "SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'",
 'SELECT count(*) FROM CONTINENTS;',
 'SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;',
 'SELECT count(*) FROM COUNTRIES;',
 'SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;',
 'SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;',
 'SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)',
 "SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';",
 'SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);',
 'SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;',
 'SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;',
 'select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;',
 'SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;',
 'SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"',
 'SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"',
 'SELECT Airline ,  Abbreviation FROM AIRLINES WHERE Country  =  "USA"',
 'SELECT AirportCode ,  AirportName FROM AIRPORTS WHERE city  =  "Anthony"',
 'SELECT count(*) FROM AIRLINES',
 'SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"',
 'SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"',
 'SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"',
 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1',
 'SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1',
 'SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1',
 'SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"',
 'SELECT count(*) FROM employee',
 'SELECT name FROM employee ORDER BY age',
 'SELECT count(*) ,  city FROM employee GROUP BY city',
 'SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1',
 'SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION',
 'SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)',
 'SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1',
 'SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1',
 'SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)',
 'SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1',
 'SELECT sum(bonus) FROM evaluation',
 'SELECT count(*) FROM Documents',
 'SELECT document_id ,  document_name ,  document_description FROM Documents',
 'SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"',
 'SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"',
 'SELECT count(DISTINCT template_id) FROM Documents',
 'SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1',
 'SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1',
 'SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents',
 'SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1',
 'SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1',
 'SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id',
 'SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1',
 'SELECT count(*) FROM teacher',
 'SELECT Name FROM teacher ORDER BY Age ASC',
 'SELECT Age ,  Hometown FROM teacher',
 'select name from teacher where hometown != "little lever urban district"',
 'SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33',
 'SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1',
 'SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1',
 'SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name',
 'SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"',
 'SELECT count(*) FROM visitor WHERE age  <  30',
 'SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC',
 'SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4',
 'SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC',
 'SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1',
 'SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009',
 'SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)',
 'SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1',
 'SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1',
 'SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)',
 'SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1',
 'SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011',
 'SELECT count(*) FROM players',
 'SELECT count(*) FROM matches',
 "SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'",
 'SELECT avg(loser_age) ,  avg(winner_age) FROM matches',
 'SELECT avg(winner_rank) FROM matches',
 'SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016',
 'SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016',
 "SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'",
 'SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1',
 'SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1',
 "SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'",
 'SELECT name ,  tonnage FROM ship ORDER BY name DESC',
 'SELECT name ,  date FROM battle',
 'SELECT max(killed) ,  min(killed) FROM death',
 'SELECT avg(injured) FROM death',
 'SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10',
 'SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1',
 'SELECT count(DISTINCT RESULT) FROM battle',
 "SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );",
 "SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'",
 'SELECT line_1 ,  line_2 FROM addresses',
 'SELECT count(*) FROM Courses',
 "SELECT course_description FROM Courses WHERE course_name  =  'math'",
 "SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'",
 'SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1',
 'select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1',
 "SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'",
 'SELECT section_name ,  section_description FROM Sections',
 'SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1',
 "SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'",
 'SELECT semester_name FROM Semesters WHERE semester_id NOT IN( SELECT semester_id FROM Student_Enrolment )',
 'SELECT count(*) ,  student_course_id FROM Transcript_Contents GROUP BY student_course_id ORDER BY count(*) DESC LIMIT 1',
 'SELECT Title FROM Cartoon ORDER BY title',
 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";',
 'SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";',
 'SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date',
 'SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";',
 'SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;',
 'SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;',
 'SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;',
 "SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'",
 "SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'",
 'SELECT count(*) FROM poker_player',
 'SELECT Earnings FROM poker_player ORDER BY Earnings DESC',
 'SELECT Final_Table_Made ,  Best_Finish FROM poker_player',
 'SELECT avg(Earnings) FROM poker_player',
 'SELECT Money_Rank FROM poker_player ORDER BY Earnings DESC LIMIT 1',
 'SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID WHERE T2.Earnings  >  300000',
 'SELECT T1.Birth_Date FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Earnings ASC LIMIT 1',
 'SELECT T2.Money_Rank FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Height DESC LIMIT 1',
 'SELECT Nationality FROM people GROUP BY Nationality ORDER BY COUNT(*) DESC LIMIT 1',
 'SELECT count(*) FROM area_code_state',
 'SELECT contestant_number ,  contestant_name FROM contestants ORDER BY contestant_name DESC',
 'SELECT vote_id ,  phone_number ,  state FROM votes',
 'SELECT max(area_code) ,  min(area_code) FROM area_code_state',
 "SELECT max(created) FROM votes WHERE state  =  'CA'",
 "SELECT contestant_name FROM contestants WHERE contestant_name != 'Jessie Alloway'",
 'SELECT T1.contestant_number , T1.contestant_name FROM contestants AS T1 JOIN votes AS T2 ON T1.contestant_number  =  T2.contestant_number GROUP BY T1.contestant_number ORDER BY count(*) ASC LIMIT 1',
 'SELECT count(*) FROM contestants WHERE contestant_number NOT IN ( SELECT contestant_number FROM votes )',
 'SELECT T1.area_code FROM area_code_state AS T1 JOIN votes AS T2 ON T1.state  =  T2.state GROUP BY T1.area_code ORDER BY count(*) DESC LIMIT 1',
 'SELECT Name FROM country WHERE IndepYear  >  1950',
 'SELECT count(*) FROM country WHERE GovernmentForm  =  "Republic"',
 'SELECT sum(SurfaceArea) FROM country WHERE Region  =  "Caribbean"',
 'SELECT Region FROM country AS T1 JOIN city AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Name  =  "Kabul"',
 'SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.Name  =  "Aruba" ORDER BY Percentage DESC LIMIT 1',
 'SELECT Population ,  LifeExpectancy FROM country WHERE Name  =  "Brazil"',
 'SELECT Population ,  Region FROM country WHERE Name  =  "Angola"',
 'SELECT Name FROM country WHERE Continent  =  "Asia" ORDER BY LifeExpectancy LIMIT 1',
 'SELECT T1.Name FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Name ORDER BY COUNT(*) DESC LIMIT 1',
 'SELECT T1.Continent FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode GROUP BY T1.Continent ORDER BY COUNT(*) DESC LIMIT 1',
 'SELECT DISTINCT T1.Region FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T2.Language  =  "English" OR T2.Language  =  "Dutch"',
 'SELECT T2.Language FROM country AS T1 JOIN countrylanguage AS T2 ON T1.Code  =  T2.CountryCode WHERE T1.GovernmentForm  =  "Republic" GROUP BY T2.Language HAVING COUNT(*)  =  1',
 'SELECT count(*) FROM conductor',
 'SELECT Name FROM conductor ORDER BY Age ASC',
 "SELECT Name FROM conductor WHERE Nationality != 'USA'",
 'SELECT max(SHARE) ,  min(SHARE) FROM performance WHERE TYPE != "Live final"',
 'SELECT Name FROM conductor ORDER BY Year_of_Work DESC LIMIT 1',
 'SELECT T1.Name ,  T2.Orchestra FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID',
 'SELECT T1.Name FROM conductor AS T1 JOIN orchestra AS T2 ON T1.Conductor_ID  =  T2.Conductor_ID GROUP BY T2.Conductor_ID ORDER BY COUNT(*) DESC LIMIT 1',
 'SELECT Record_Company FROM orchestra GROUP BY Record_Company ORDER BY COUNT(*) DESC LIMIT 1',
 'SELECT Orchestra FROM orchestra WHERE Orchestra_ID NOT IN (SELECT Orchestra_ID FROM performance)',
 'SELECT Record_Company FROM orchestra WHERE Year_of_Founded  <  2003 INTERSECT SELECT Record_Company FROM orchestra WHERE Year_of_Founded  >  2003',
 'SELECT count(*) FROM Highschooler',
 'SELECT name ,  grade FROM Highschooler',
 'SELECT grade FROM Highschooler',
 'SELECT grade FROM Highschooler WHERE name  =  "Kyle"',
 'SELECT count(*) FROM Highschooler WHERE grade  =  9 OR grade  =  10',
 'SELECT grade ,  count(*) FROM Highschooler GROUP BY grade',
 'SELECT grade FROM Highschooler GROUP BY grade ORDER BY count(*) DESC LIMIT 1',
 'SELECT T2.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1',
 'SELECT T3.name FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id JOIN Highschooler AS T3 ON T1.friend_id  =  T3.id WHERE T2.name  =  "Kyle"',
 'SELECT id FROM Highschooler EXCEPT SELECT student_id FROM Friend',
 'SELECT T2.name FROM Likes AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1',
 'SELECT min(grade) FROM Highschooler WHERE id NOT IN (SELECT T1.student_id FROM Friend AS T1 JOIN Highschooler AS T2 ON T1.student_id  =  T2.id)',
 'SELECT state FROM Owners INTERSECT SELECT state FROM Professionals',
 'SELECT avg(age) FROM Dogs WHERE dog_id IN ( SELECT dog_id FROM Treatments )',

In [23]:
curated_dataset.push_to_hub('alagaesia/spider_dev_subset_preds', token=HUGGING_FACE_WRITE_TOKEN)

Pushing dataset shards to the dataset hub:   0%|          | 0/1 [00:00<?, ?it/s]

Creating parquet from Arrow format:   0%|          | 0/1 [00:00<?, ?ba/s]

Downloading metadata:   0%|          | 0.00/520 [00:00<?, ?B/s]

In [24]:
curated_dataset.save_to_disk('spider_dev_subset_preds')

Saving the dataset (0/1 shards):   0%|          | 0/209 [00:00<?, ? examples/s]

In [ ]:
total = 0 
for key in db_ids.keys():
    print(key)
    tot = 0 
    for val in db_ids[key].keys():
        tot += db_ids[key][val]
    print(tot)
    #print(db_ids[key])
    total += tot

print(total)

In [ ]:
sqp.data[hf_spider_dev]